Revit 2026 API

# KeyBasedTreeEntryError Class

---

This class contains information about a problem encountered while creating a KeyBasedTreeEntries object.

SystemObject Autodesk.Revit.DBKeyBasedTreeEntryError

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class KeyBasedTreeEntryError : IDisposable
```
```vb
Public Class KeyBasedTreeEntryError
	Implements IDisposable
```
```cpp
public ref class KeyBasedTreeEntryError : IDisposable
```
```fsharp
type KeyBasedTreeEntryError =
    class
        interface IDisposable
    end
```

The KeyBasedTreeEntryError type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | ErrorType | Indicates which of possible types of problems with loading and/or building a KeyBasedTreeEntries that this KeyBasedTreeEntryError represents. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Releases all resources used by the KeyBasedTreeEntryError |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetEntry | Gets the entry for which an error occurred while building the KeyBasedTreeEntries object. |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

This problem might be a duplicate entry, or an error in the specified parent-child relationships, or something else. See BuiltInKeyBasedTreeEntryErrorType for details.

#### Reference

Autodesk.Revit.DB Namespace